In [9]:
# import Pandas data analysis library
# By convention, libraries are loaded at top of notebook so you know what tools are being used
import pandas as pd
# 'as pd' lets you reference the library functions with pd.function(), not pandas.function() for brevity

## Loading data

In [23]:
# load csv data as a Pandas DataFrame object (i.e. table)
# this is a list of all tax exempt nonprofits in Montana, from the IRS
# Source: https://www.irs.gov/charities-non-profits/exempt-organizations-business-master-file-extract-eo-bmf
# Data dictionary (what's in each column): 

df = pd.read_csv('data/irs_exempt_org_list_mt.csv')

In [4]:
# .head() command shows first five rows - good for previewing data to ensure it imported correctly
df.head()

,EIN,NAME,ICO,STREET,CITY,STATE,ZIP,GROUP,SUBSECTION,AFFILIATION,...,ASSET_CD,INCOME_CD,FILING_REQ_CD,PF_FILING_REQ_CD,ACCT_PD,ASSET_AMT,INCOME_AMT,REVENUE_AMT,NTEE_CD,SORT_NAME
0,10571299,HILLSIDE CHURCH,% TERESA PARKER,5685 HWY 93 S,WHITEFISH,MT,59937-8523,1489,3,9,...,0,0,6,0,12,NaN,NaN,NaN,NaN,NaN
1,10613656,CHAPEL OF HOPE MINISTRIES OF ROUNDUP,% MERLE & LOUISE HUNT,16843 HWY 12 WEST,ROUNDUP,MT,59072-0000,0,3,3,...,3,3,6,0,9,NaN,NaN,NaN,X20,YCH
2,10649149,MONTANA 4-H FOUNDATION INC,% MUSSELSHELL-GOLDEN VALLEY COUNTY,204 8TH AVE E,ROUNDUP,MT,59072-2347,5954,3,9,...,0,0,2,0,9,0.0,0.0,0.0,NaN,MUSSELSHELL GOLDEN VALLEY 4H COUNCI
3,10667433,KNIGHTS OF COLUMBUS,% WM TODD WOHLMAN FIN SEC,PO BOX 851,STEVENSVILLE,MT,59870-0851,188,8,9,...,0,0,2,0,12,0.0,0.0,0.0,NaN,13093 OUR LADY OF THE MOUNTAINS
4,10671365,GARDEN CITY NEIGHBORS INC,% PETER B HANCE,1235 34TH STREET,MISSOULA,MT,59801-8516,0,3,3,...,6,1,2,0,3,1223205.0,4479.0,4479.0,L21,NaN

In [8]:
# Number of rows in data
len(df)

10890

In [7]:
# list all columns in data
df.columns

Index(['EIN', 'NAME', 'ICO', 'STREET', 'CITY', 'STATE', 'ZIP', 'GROUP',
       'SUBSECTION', 'AFFILIATION', 'CLASSIFICATION', 'RULING',
       'DEDUCTIBILITY', 'FOUNDATION', 'ACTIVITY', 'ORGANIZATION', 'STATUS',
       'TAX_PERIOD', 'ASSET_CD', 'INCOME_CD', 'FILING_REQ_CD',
       'PF_FILING_REQ_CD', 'ACCT_PD', 'ASSET_AMT', 'INCOME_AMT', 'REVENUE_AMT',
       'NTEE_CD', 'SORT_NAME'],
      dtype='object')

In [11]:
# Select a specific column (aka a 'Series')
# NOTE square brackets. Either single or double quotes works around column name
df['NAME']
# Note ellipses for ommitted data

0                                          HILLSIDE CHURCH
1                     CHAPEL OF HOPE MINISTRIES OF ROUNDUP
2                               MONTANA 4-H FOUNDATION INC
3                                      KNIGHTS OF COLUMBUS
4                                GARDEN CITY NEIGHBORS INC
                               ...
10885                    ROCKY MOUNTAIN ELK FOUNDATION INC
10886                           TIBETAN LANGUAGE INSTITUTE
10887    WHISPERING PINES RECREATIONAL LANDOWNERS ASSOC...
10888                                 ALOHA NOBLEHOUSE INC
10889                    ROCKY MOUNTAIN ELK FOUNDATION INC
Name: NAME, Length: 10890, dtype: object

In [12]:
# Describe numerical columns
df['REVENUE_AMT'].describe()

count    8.251000e+03
mean     1.063926e+06
std      1.800551e+07
min     -2.174190e+05
25%      0.000000e+00
50%      0.000000e+00
75%      7.617750e+04
max      9.498996e+08
Name: REVENUE_AMT, dtype: float64

In [13]:
# Show value counts for nominal/categorical/text columns
df['CITY'].value_counts()

MISSOULA       1593
BILLINGS        962
HELENA          787
BOZEMAN         720
GREAT FALLS     545
               ...
MOORE             1
NEIHART           1
GLEN              1
TWO DOT           1
MUSSELSHELL       1
Name: CITY, Length: 340, dtype: int64

In [48]:
# Sum a specific column
# Here, total revenue for MT nonprofits in list - $8 TRILLION
df['REVENUE_AMT'].sum()

8778452332.0

## Basic manipulation operations

See cleaning example notebook for more detail

1. Select subset of columns (equivalent to SELECT in SQL)
2. Filter rows by criterial  (equivalent to WHERE in SQL)
3. Sort (equivalent to SORT BY in SQL)
4. Aggregate (equivalent to GROUP BY in SQL)

### Selecting a subset of columns

In [32]:
# Useful for making big data sets like this one less cumbersome to work with
include_columns = ['NAME', 'CITY', 'REVENUE_AMT'] # List of column names you want
df_subset = df[include_columns]
df_subset.head() # show first five rows

                                   NAME          CITY  REVENUE_AMT
0                       HILLSIDE CHURCH     WHITEFISH          NaN
1  CHAPEL OF HOPE MINISTRIES OF ROUNDUP       ROUNDUP          NaN
2            MONTANA 4-H FOUNDATION INC       ROUNDUP          0.0
3                   KNIGHTS OF COLUMBUS  STEVENSVILLE          0.0
4             GARDEN CITY NEIGHBORS INC      MISSOULA       4479.0

In [33]:
# This can also be done in a single line of code
df_subset = df[['NAME', 'CITY', 'REVENUE_AMT']] # Note nested square brackets

### Filtering

In [34]:
# Select only nonprofits in 'HELENA'

# Step 1: Create a 'filter array'
# This is an array of True/False values, essentially whether each row in the data passes the test
# In this case, True means 'CITY' == 'HELENA', False means that's not the case
filter_series = df_subset['CITY'] == 'HELENA'

filter_series.head()

0    False
1    False
2    False
3    False
4    False
Name: CITY, dtype: bool

In [25]:
# Step 2:
# Use filter array to select specific rows from source data frame
in_helena = df_subset[filter_series]

print('Number of tax exempt orgs in Helena:', len(in_helena))
in_helena.head()

Number of tax exempt orgs in Helena: 787

                                              NAME    CITY  REVENUE_AMT
20         MONTANA SOUTHERN BAPTIST CONVENTION INC  HELENA          NaN
26       MONTANA FISH AND WILDLIFE CONSERVATION TR  HELENA          NaN
51        FULL GOSPEL RESTORATION CHURCH OF HELENA  HELENA          NaN
104                     MONTANA 4-H FOUNDATION INC  HELENA          0.0
109  MONTANA COUNCIL ON DEVELOPMENTAL DISABILITIES  HELENA     539620.0

In [27]:
# This is typically done as a combined one-line operation
in_helena = df_subset[df_subset['CITY'] == 'HELENA']
in_helena.head()

                                                    NAME    CITY  REVENUE_AMT
20               MONTANA SOUTHERN BAPTIST CONVENTION INC  HELENA          NaN
26             MONTANA FISH AND WILDLIFE CONSERVATION TR  HELENA          NaN
51              FULL GOSPEL RESTORATION CHURCH OF HELENA  HELENA          NaN
104                           MONTANA 4-H FOUNDATION INC  HELENA          0.0
109        MONTANA COUNCIL ON DEVELOPMENTAL DISABILITIES  HELENA     539620.0
...                                                  ...     ...          ...
10582                         TOASTMASTERS INTERNATIONAL  HELENA          NaN
10624  SALON NATIONAL LABOUTIQUE DES HUIT CHAPEAUX ET...  HELENA          0.0
10648                 CORRECTIONS TECHNOLOGY ASSOCIATION  HELENA     222326.0
10842                      FEATHERED PIPE FOUNDATION INC  HELENA     577062.0
10846                        ARTEMIS WILDLIFE FOUNDATION  HELENA     103461.0

[787 rows x 3 columns]

### Sorting

In [35]:
# Largest nonprofits in Helena by reported revenue
in_helena_sorted_descending = in_helena.sort_values('REVENUE_AMT', ascending=False) # ascending=False sorts descending

# Top 10
in_helena_sorted_descending.head(10)

                                                   NAME    CITY  REVENUE_AMT
2813                         MONTANA HEALTH COOPERATIVE  HELENA  316396976.0
4710                                   ST PETERS HEALTH  HELENA  237827672.0
4680                                    CARROLL COLLEGE  HELENA   64353083.0
5864                       MONTANA UNIFIED SCHOOL TRUST  HELENA   55531694.0
4689                  MONTANA CHILDRENS HOME & HOSPITAL  HELENA   31538578.0
5644  MONTANA HIGHER EDUCATION STUDENT ASSISTANCE CO...  HELENA   30007913.0
6601                   MONTANA COMMUNITY FOUNDATION INC  HELENA   17028641.0
5092         MOUNTAIN-PACIFIC QUALITY HEALTH FOUNDATION  HELENA   16590640.0
4874                       MONTANA HOSPITAL ASSOCIATION  HELENA   10794221.0
4681         INTERMOUNTAIN DEACONESS CHILDRENS SERVICES  HELENA    9269419.0

## Aggregation

See https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/ for a more comprehensive tutorial

In [38]:
# Show total amount of reported tax exempt org revenue, by city

# Step 1: Group by a column
grouped = df_subset.groupby('CITY')

# This doesn't display nicely, unfortunately
grouped

In [43]:
# Aside: you can specific groups with .get_group(<value>)
east_helena = grouped.get_group('EAST HELENA')
east_helena.head()

                                    NAME         CITY  REVENUE_AMT
16        SON RISE TRUCKING MINISTRY INC  EAST HELENA          0.0
262                        FILAM MONTANA  EAST HELENA          0.0
423  UNIFIED BOATERS OF CANYON FERRY INC  EAST HELENA          0.0
523            JOHNNY WALKER RELIEF FUND  EAST HELENA          0.0
900                       SONS OF NORWAY  EAST HELENA          0.0

In [49]:
# Step 2: Apply aggregation

total_by_city = grouped.agg(
    total_city_revenue=('REVENUE_AMT', 'sum') # Take sum of revenue amounts in group
)
# Format for is col_name=('col_to_aggregate', 'aggregation_function')
# aggregation_function can be 'sum', 'count', 'max', 'min', etc.
# See https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/ for complete list
# Also you can define your own if you really want to

total_by_city.sort_values('total_city_revenue', ascending=False)

             total_city_revenue
CITY
BILLINGS           1.774206e+09
GREAT FALLS        1.350055e+09
HELENA             1.018756e+09
SIDNEY             7.365887e+08
KALISPELL          6.875648e+08
...                         ...
OPHEIM             0.000000e+00
OUTLOOK            0.000000e+00
ELLISTON           0.000000e+00
E HELENA           0.000000e+00
ZORTMAN            0.000000e+00

[340 rows x 1 columns]